app/controllers/players_controller.rb

SELECT  "players".* FROM "players" ORDER BY "players"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def show
    @player = Player.first